ticketee/app/views/projects/show.html.erb

SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = 4
---
<ul id='tickets'>
  <% @project.tickets.each do |ticket| %>