ticketee/app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    @projects = Project.for(current_user).all

INSERT INTO "projects" ("created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Wed, 13 Mar 2013 01:32:52 UTC +00:00], ["description", "bar"], ["name", "foo"], ["updated_at", Wed, 13 Mar 2013 01:32:52 UTC +00:00]]
---
  def create
    @project = Project.new(params[:project])
    if @project.save

UPDATE "projects" SET "description" = 'bar baz', "updated_at" = '2013-03-13 01:33:22.489265' WHERE "projects"."id" = 1
---
  def update
    if @project.update_attributes(params[:project])

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "2"]]
---
  def find_project
    @project = Project.for(current_user).find(params[:id])