ticketee/app/controllers/tickets_controller.rb

  def create
    @ticket = @project.tickets.build(params[:ticket])
    @ticket.user = current_user
    if @ticket.save
---
INSERT INTO "tickets" ("created_at", "description", "project_id", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 13 Mar 2013 20:07:00 UTC +00:00], ["description", "foo ticket description"], ["project_id", 5], ["title", "foo ticker"], ["updated_at", Wed, 13 Mar 2013 20:07:00 UTC +00:00]]

  def find_project
    @project = Project.for(current_user).find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "5"]]

  def find_ticket
    @ticket = @project.tickets.find(params[:id])
---
SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = 5 AND "tickets"."id" = ? LIMIT 1  [["id", "1"]]